apis/extractor/test/load.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: https://production.sushi.com/swap/v3.2

  phases:
    - duration: 30
      arrivalRate: 25
      rampTo: 50
      name: Warm up the API
    - duration: 60
      arrivalRate: 50
      rampTo: 100
      name: Ramp up to peak load
    - duration: 120
      arrivalRate: 100
      name: Sustained peak load

  processor: "./processor.js"
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  plugins:
    expect: {}
scenarios:
  - flow:
      - function: "setQuery"
      - get:
          url: "/?chainId={{ query.chainId }}&tokenIn={{ query.tokenIn }}&tokenOut={{ query.tokenOut }}&amount={{ query.amount }}&to={{ query.to }}"
          expect:
            - statusCode: 200